import random

HELLO_MSG = r"""                 
<b><i>Да здравствует, ваше Величество!</i></b>                                                                                  

Я - рыцарь <b>CollageBot</b>, что был призван охранять фоторафии моих сузеренов и давать к ним отрытый доступ. 

 ⚔️ Вот поподробнее о моих функциях:

🗡 <code>\load_image</code> – с помощью электронных голубей, делаю ваши изображения достоянием для жителей всего королевства.

🗡 <code>\get_collage</code> – создаю коллаж по вашим запросам, ища материалы в великой библиотеке "База данных".
                     """

LOAD_IMAGE_TAGS_PLS_MSG = r"""
<b><i>Ваше сиятельство, оно прекрасно!</i></b>

Теперь, пришла пора выбрать какие теги будут защитниками, чтобы ваше замечательное изображение не затерялось!

📖Вот инструкция по составлению тегов:

1. <b>Теги пишутся с символом</b> "<b>#</b>", чтобы не убежали👀 (Например: #красота).

2. <b>Если в одном теге хотите несколько слов, то смело вперёд</b>▶️ (Например: #гордостьипредубеждение)

3.  <b>Если хотите написать больше одного тега, то тогда пишите их через пробел</b>, я боюсь как им не было тесно👬 (Например: #гордостьипредубеждение #красота #достоинство)
"""

LOAD_IMAGE_MANUAL_MSG = r"""
                <b><i>Ваше превосходительство, слушаюсь и повинуюсь!</i></b>

Выберите изображение, которое желаете отправить в сокровищницу.

👑Ограничения королевского декрета для файлов:                                                          

1. <b>Формат</b>: PNG, JPG, JPEG, WEBP (в противном случае свитки сгниют📜)

2. <b>Цензура</b>: не 18+ контент (😭😭😭)

3. <b>Размер</b>: не более 2MB (иначе голуби не долетят🕊)
 
4. <b>Вид</b>: отправка файла в несжатом виде (не хочу марать ваши величественные длани🥰)
                """

UNEXPECTED_TEXT_MSG = r"""
Ваше величество, ваши изречения слишком сложны для вашего покорного слуги, чтобы он что-то смог понять.😔
                            
<b>Пожалуйста, используйте кнопки.</b>
"""

SUCCESS_MSG = r"""✅<b>Всё прошло успешно, ваше величество!
Уверен вашему изображению сулит большая слава.</b>
"""

USER_MISTAKE_GETUP_MSGS = [
r"""❌<b>Ошибка.</b>

Ваше превосходительство, ошибается только тот, кто горит рвением, проверьте, следовали ли вы декрету.
""",

r"""❌<b>Ошибка.</b>

Мой король, настойчивость - мать удачи, попробуйте снова, следуя декрету.
""",

r"""❌<b>Ошибка.</b>

Ваше величество, Иерусалим не за 1 день захватили и не раз, не отчаивайтесь, декрет вам укажет путь.
""",

r"""❌<b>Ошибка.</b>

Ваше величество, я с вами до конца, не опускайте рук, декрет создан, чтобы не ошибаться.
"""
]

def user_mistake_msg() -> str:
    return random.choice(USER_MISTAKE_GETUP_MSGS)