import random
from telebot import types
from collections import defaultdict
import threading
import os
from dotenv import load_dotenv  # for parsing .env file


MAX_FILE_SIZE = 2 * 1024 * 1024 # 2 MB
EXPECTED_FORMATS = [".jpg", ".png", ".jpeg", ".webp"]
MAX_TAG_LENGTH = 30
TAGS_PER_PAGE = 50
MAX_INLINE_COLS = 3 # max count of columns in inline keyboard
MAX_INLINE_ROWS = 2 # max count of rows in inline keyboard
COLLAGE_IMG_COUNT = {
    2: (1, 2),
    4: (2, 2),
    6: (2, 3),
    9: (3, 3),
}

# once initialize keyboard as global scoped
markup = types.ReplyKeyboardMarkup(resize_keyboard=True)

MAKE_COLLAGE = "Составить коллаж"
LOAD_IMAGE = "Загрузить изображение"
DELETE_DATA = "delete_my_data"
START = "start"
COMMANDS = [MAKE_COLLAGE, LOAD_IMAGE, START, DELETE_DATA]

markup.add(
    types.KeyboardButton(MAKE_COLLAGE),
    types.KeyboardButton(LOAD_IMAGE),
)

# Timer for bulk load images
album_timers = defaultdict(threading.Timer)
album_lock = threading.Lock()
AWAITING_FOR_LOAD_IMAGE = "Жду изображения для load_image"

load_dotenv('./config.env')
BOT_API_KEY = os.getenv('BOT_API_KEY')
MEDIA_ROOT = os.getenv('MEDIA_ROOT')
IMAGES_DIR = os.path.join(MEDIA_ROOT, "images")


STATES = {
    AWAITING_FOR_LOAD_IMAGE: False
}

cached_messages = defaultdict(list)

HELLO_MSG = r"""                 
<b><i>Да здравствует, ваше Величество!</i></b>                                                                                  

Я - рыцарь <b>CollageBot</b>, что был призван охранять фоторафии моих сузеренов и давать к ним отрытый доступ. 

 ⚔️ Вот поподробнее о моих функциях:

🗡 <code>\load_image</code> – с помощью электронных голубей, делаю ваши изображения достоянием для жителей всего королевства.

🗡 <code>\get_collage</code> – создаю коллаж по вашим запросам, ища материалы в великой библиотеке "База данных".
                     """

TAGS_PLS_MSG = r"""
<b><i>Ваше сиятельство, оно прекрасно!</i></b>

Теперь, пришла пора выбрать какие теги будут защитниками, чтобы ваше замечательное изображение не затерялось!

📖Вот инструкция по составлению тегов:

1. <b>Теги пишутся с символом</b> "<b>#</b>", чтобы не убежали👀 (Например: #красота).

2. <b>Если в одном теге хотите несколько слов, то смело вперёд</b>▶️ (Например: #гордостьипредубеждение)

3.  <b>Если хотите написать больше одного тега, то тогда пишите их через пробел</b>, я боюсь как им не было тесно👬 (Например: #гордостьипредубеждение #красота #достоинство)
"""

LOAD_IMAGE_MANUAL_MSG = rf"""
                <b><i>Ваше превосходительство, слушаюсь и повинуюсь!</i></b>

Выберите 1 или несколько изображений, которые желаете отправить в сокровищницу.

👑Ограничения королевского декрета для файлов:                                                          

1. <b>Формат</b>: {", ".join(EXPECTED_FORMATS)} (в противном случае свитки сгниют📜)
2. <b>Цензура</b>: не 18+ контент (😭😭😭)
3. <b>Размер</b>: не более 2MB (иначе голуби не долетят🕊)
4. <b>Вид</b>: отправка файлов в сжатом виде (не хочу марать ваши величественные длани🥰)
                """

PRIVACY_POLICY_MSG = rf"""
👑 <b>Выберите 1 или несколько изображений, которые желаете отправить в сокровищницу.</b>

🔒 <b><i>Политика конфиденциальности и использования изображений</i></b>

1. <b>Все загружаемые вами изображения</b> становятся общедоступными и могут быть использованы другими пользователями бота для создания коллажей.  

2. <b>Требования:</b> 
   • <b>Формат</b>: {", ".join(EXPECTED_FORMATS)}
   • <b>Вид</b>: отправка файлов в сжатом виде

3. <b>Не загружайте:</b>  
   • Личные или конфиденциальные материалы  
   • Изображения, защищенные авторским правом (без вашего права на распространение)  
   • Контент, нарушающий правила Telegram (18+, насилие и т. д.)  

4. <b>Администрация не несет ответственности</b> за использование ваших изображений третьими лицами.  

5. Отправляя боту фотографии, вы подтверждаете, что:  
   • Имеете права на распространение этих изображений  
   • Согласны с их общедоступностью  

ℹ️ Полный текст политики: <a href="https://github.com/user-attachments/files/21559518/PrivacyPolicy.pdf">читать</a>
"""

UNEXPECTED_FILE_FORMAT_MSG = r"""
Ваше величество! ⚔️📜

Мои сокольничьи доложили, что вы отправили <b>несжатые свитки изображений</b>! 

Дабы сохранить ваши королевские длани чистыми, а наши голубятни - в порядке, прошу вас:

1. Открыть изображение в <b>королевском альбоме</b> (галерее)
2. Выбрать опцию <b>"Отправить как фото"</b> (не как файл!)

Так ваши изображения быстрее достигнут нашей сокровищницы, не отягощая крылья наших верных голубей!
"""

UNEXPECTED_MSG = r"""
Ваше величество, ваши изречения слишком сложны для вашего покорного слуги, чтобы он что-то смог понять.😔
                            
<b>Пожалуйста, используйте кнопки.</b>
"""

SUCCESS_MSG = r"""✅<b>Всё прошло успешно, ваше величество!
Уверен вашему изображению сулит большая слава.</b>🏆
"""

USER_MISTAKE_GETUP_MSGS = [
r"""❌<b>Ошибка.</b>

Ваше превосходительство, ошибается только тот, кто горит рвением, проверьте, следовали ли вы декрету.
""",

r"""❌<b>Ошибка.</b>

Мой король, настойчивость - мать удачи, попробуйте снова, следуя декрету.
""",

r"""❌<b>Ошибка.</b>

Ваше величество, Иерусалим не за 1 день захватили и не раз, не отчаивайтесь, декрет укажет вам путь.
""",

r"""❌<b>Ошибка.</b>

Ваше величество, я с вами до конца, не опускайте рук, декрет создан, чтобы не ошибаться.
"""
]

USER_MISTAKE_TAGS_MSGS = [
r"""❌<b>Ошибка.</b>

Ваше превосходительство, ошибается только тот, кто горит рвением, проверьте, следовали ли вы инструкции.
""",

r"""❌<b>Ошибка.</b>

Мой король, настойчивость - мать удачи, попробуйте снова, следуя инструкции.
""",

r"""❌<b>Ошибка.</b>

Ваше величество, Иерусалим не за 1 день захватили и не раз, не отчаивайтесь, инструкция укажет вам путь.
""",

r"""❌<b>Ошибка.</b>

Ваше величество, я с вами до конца, не опускайте рук, инструкция создана, чтобы не ошибаться.
"""
]

UNEXPECTED_IMG_MSG = r"""
Ваше превосходительство, не отправляйте бедное изображение без охраны в виде тегов, оно же умрёт.
                            
<b>Пожалуйста, используйте кнопки.</b>
"""

LARGE_FILE_MSG = r"""
О, ваше величество!

Пожалейте голубей, они не долетят и погибнут, ведь у вас <b>слишком большой свиток</b>😉 (<i>документ</i>).
"""

UNEXPECTED_IMG_FORMAT_MSG = r"""
О, ваше величество!

Пожалейте пергамент, он так сгниёт, потому что <b>неправильный формат файла</b>🧐.
"""

LOAD_IMG_FAIL_MSG = r"""
О, ваше величество!

Смилуйтесь над вашими презренными подданными, ваши воины-теги не смогли защитить изображение, и теперь оно в рабстве, я облажался🥺 (<i>произошла ошибка в загрузке изображения или тегов</i>).

"""

LOSED_FILE_ID_MSG = r"""
Ваше превосходительство, смею огорчить, что желанное изображение не было найдено, так как в великой библиотеке <b>не нашлось документов по вашему приказу</b>.📚

"""

UNDEFINED_FAIL_MSG = r"""
Ваше превосходительство, примите мои извинения, великая библиотека слишком велика и <b>ваше поручение не удалось исполнить</b>🤡 (<i>неизвестная ошибка</i>).

"""

SAME_TAGS_ERROR_MSG = r"""
Мой король, я не понял смысл ваших строк, можете попробовать снова? (<i>теги по вашему запросу не были найдены</i>)

"""

EMPTY_TAG_ERROR_MSG = r"""
О, нет, ваше величество!

Вы же не послали воинов-тегов с вашим изображением <b> как бы с ним, что не случилось</b>😈.
"""

NO_IMAGES_FOUND_MSG = r"""
Ваше величество! ⚔️📜

С великой печалью докладываю, что в королевской сокровищнице <b>не нашлось изображений</b>, соответствующих вашему указу.

Что делать:
• Попробуйте <b>более распространённые теги</b> из списка популярных
• <b>Загрузите первыми</b> изображения по этой теме
• Проверьте <b>правильность написания</b> тегов

"""

LARGE_TAG_MSG = fr"""
Ваше величество, этот воин-тег слишком огромен, <b> как бы с вашим сообщением, что не случилось</b>😈 (максимальная длина тега = {MAX_TAG_LENGTH}).

"""

GET_COLLAGE_MANUAL_MSG = r"""
<b><i>Ваше сиятельство, я сейчас же отравлюсь на поиски!</i></b>

Но прежде всего, сделайте выбор:                                                    

<b>Ввести запрос</b> - издайте королевский указ🧑‍⚖️

<i>Просто введите предложение, которое описывает ваш будущий коллаж (например: летний солнечный пляж).</i>

<b><i>ИЛИ</i></b>

<b>Выбрать из популярных тегов</b> - узнайте о чём толкует чернь🦻

<i>Просто нажмите на доступные вам популярные теги.</i>

"""

DELETE_DATA_MSG = r"""
⚔️ *Королевский Указ о Великом Уничтожении* ⚔️

<em>Ваше величество, вы повелеваете предать огню все ваши изображения в нашей сокровищнице!</em>

📜 <b>Последнее предупреждение:</b>
• Все ваши фото будут <b>безвозвратно утеряны</b>

<em>"Как меч, однажды вынутый из ножен, не может вернуться назад, так и удаленные изображения не смогут быть восстановлены"</em>

🗡️ <b>Подтвердите ваш указ:</b>
"""

LOAD_FIRST_IMAGE_MSG = r"""
🔮 *Таинственная Пустота в Волшебном Архиве* 🔮

<em>О, Великий Искатель Сокровищ, наши древние фолианты тегов пустуют!</em>

📖 <b>Ты стоишь на пороге великого:</b>
• В хранилище ещё <b>нет ни единого тега</b>
• Ты можешь стать <b>первопроходцем</b> этого царства

<em>"Как первый луч солнца освещает нетронутые земли, так и твоё первое изображение откроет новую эру в наших архивах"</em>

🖼️ <b>Повелеваю тебе:</b>
Загрузи первое изображение и стань <b>основателем</b> этой коллекции!
"""

CHOOSE_CANVAS_SIZE_MSG = r"""
🎨 *Великий Указ о Размерах Холста* 🎨

<em>Ваше Величество, прежде чем начать творить, извольте выбрать размер вашего королевского полотна!</em>

<em>"Как меч должен соответствовать руке воина, так и холст должен соответствовать величию замысла"</em>

🏰 <b>Выбирайте мудро:</b> от сего решения зависит судьба вашего творения!
"""

COLLAGE_EFFECTS_MSG = r"""
✨ *Магический Выбор Эффектов* ✨

<em>О, Великий Творец Коллажей! Теперь извольте выбрать волшебные чары для вашего творения:</em>

<em>"Как истинный маг выбирает жезл, так и мастер должен выбрать эффект для своего шедевра"</em>

🖌️ <b>Выберите эффект из предложенных ниже:</b>
"""

SHARE_COLLAGE_MSG = r"""
✨ *Королевский Шедевр Готов!* ✨

<em>Ваше творение достойно украсить королевскую галерею!</em>

🏰 <b>Поделись этим коллажем со своим братством</b>
"""


def user_mistake_msg() -> str:
    return random.choice(USER_MISTAKE_GETUP_MSGS)


def is_valid_tags(hashtags: list[str]) -> tuple[bool, list[str]]:
    errors = []
    res = True
    if not hashtags:
        errors.append(EMPTY_TAG_ERROR_MSG)
        res = False

    for tag in hashtags:
        if len(tag) > MAX_TAG_LENGTH:
            errors.append(LARGE_TAG_MSG)
            res = False

    return (res, errors)