"""
Абстрактный базовый класс для объектов проекта WarerCode.

Содержит интерфейс для работы с метаданными и требует реализации методов
представления и сериализации.
"""

import abc


class WarerObject(abc.ABC):
    """
    Базовый класс проекта для всех сущностей WarerCode.

    Требует реализации методов представления и отладки.

    Атрибуты:
        hints (dict): метаданные объекта хранения.
    """

    def __init__(self):
        """
        Инициализация объекта.
        """
        self.hints = dict()

    def reset_hint(self, key):
        """
        Безопасно удаляет поле по ключу.

        Аргументы:
            key: ключ для удаления.
        """
        self.hints.pop(key, None)

    def reset_hints(self):
        """
        Сбрасывает состояние подсказок (метаданных) до пустого словаря.
        """
        self.hints = dict()

    def set_hint(self, key, value):
        """
        Добавляет или перезаписывает мета-атрибут.

        Аргументы:
            key: имя подсказки.
            value: значение подсказки.
        """
        self.hints[key] = value

    def get_hint(self, key, default=None):
        """
        Возвращает значение подсказки по ключу, либо значение по умолчанию.

        Аргументы:
            key: имя подсказки.
            default: значение по умолчанию, если ключ не найден.

        Возвращает:
            Значение подсказки или значение по умолчанию.
        """
        return self.hints.get(key, default)

    @abc.abstractmethod
    def __str__(self):
        """
        Преобразует объект в строку.
        Полезно для отладки или логирования.
        """
        pass

    @abc.abstractmethod
    def __repr__(self):
        """
        Возвращает строковое представление объекта в стиле Python.
        """
        pass

    @property
    @abc.abstractmethod
    def to_dict(self):
        """
        Возвращает представление объекта в виде словаря (например, для сериализации в JSON).

        Возвращает:
            dict: словарь, представляющий объект.
        """
        pass



if __name__ == "__main__":
    print("Базовый класс объекта WarerCode:")
    help(WarerObject)
